/*************************************************************************
	> File Name: p1055.cpp
	> Author: x
	> Mail: x.com
	> Created Time: 2018年09月02日 星期日 17时27分05秒
 ************************************************************************/

#include <stdio.h>
#include <string.h>
int main() {
	int x, y;
	char a[14];
	scanf("%s", a);
	x = ((a[0] - '0') * 1 + (a[2] - '0') * 2 + (a[3] - '0') * 3 + (a[4] - '0') * 4 + (a[6] - '0') * 5 + (a[7] - '0') * 6 + (a[8] - '0') * 7 + (a[9] - '0') * 8 + (a[10] - '0') * 9) % 11;
	y = a[12] - '0';
	if (x == y) {
		printf("Right");
	} else if (x != 10) {
		a[12] = x + '0';
		printf("%s", a);
	} else {
		if (a[12] == 'X') {
			printf("Right");
		} else {
	    	a[12] = 'X';
	    	printf("%s", a);
	    }
	}
	return 0;
}
