/*************************************************************************
	> File Name: 17.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月26日 星期四 23时27分08秒
 ************************************************************************/

#include<stdio.h>

int num1 = 3 + 3 + 5 + 4 + 4 + 3 + 5 + 5 + 4;// 1 ~ 9求和 
int num2 = 3 + 6 + 6 + 8 + 8 + 7 + 7 + 9 + 8 + 8;// 10 ～ 19求和
int num3 = 6 + 6 + 5 + 5 + 5 + 7 + 6 + 6;// 20 ～ 90（十位）求和
int num[5] = {7, 11};// num[0] hundred单词数 num[1] one thousand单词数
int main() {
    int ans = 0;
    ans = (num1 * 9 + num2 + num3 * 10) * 10 + (num1 + num[0] * 9) * 100 + 3 * 99 * 9 + num[1];//（1 ～ 99求和）* 10 + （百位求和）* 100 + 总and单词数 + 1000单词数
    printf("%d\n", ans);
    return 0;
}
