/*************************************************************************
	> File Name: 31.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月27日 星期五 10时37分25秒
 ************************************************************************/

#include<stdio.h>

#define MAX_W 8

//背包问题

int dp[205] = {0};// 储存前n种面值组成m元钱的方法
int w[MAX_W] = {1, 2, 5, 10, 20, 50, 100, 200};//硬币面额

int main() {
    dp[0] = 1;// 组成0元有一种方法
    for (int i = 0; i < 8; i++) {
        for (int j = w[i]; j <= 200; j++) {
            dp[j] += dp[j - w[i]];//降维后 现位置的方法数加上 加上w[i]面值后的方法数
        }
    }
    printf("%d\n", dp[200]);//dp[200] 为前8种硬币组成200元的方法数
    return 0;
}
