/*************************************************************************
	> File Name: 25.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月27日 星期五 17时53分25秒
 ************************************************************************/

#include<stdio.h>

//循环数组 大数加法 指针

int fib[3][1005] = {{0, 0}, {1, 1}, {1, 1}};//循环数组
int n = 2;//位数

int main() {
    while (fib[n % 3][0] < 1000) {
        n += 1;
        int *a = fib[n % 3], *b = fib[(n - 1) % 3], *c = fib[(n - 2) % 3];
        a[0] = b[0];//将前一项位数赋给后一项
        for (int i = 1; i <= b[0]; i++) {
            a[i] = b[i] + c[i];//后一项等于前两项相加
        }
        for (int i  = 1; i <= a[0]; i++) {//大数进位
            if (a[i] < 10) continue;
            a[i + 1] += a[i] / 10;
            a[i] %= 10;
            a[0] += (a[0] == i);
        }
    }
    printf("%d\n", n);
    return 0;
}
